# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/versions'
tap 'subosito/packages'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'grep'

# Install cli apps
brew 'awscli'
brew 'certbot'
brew 'cocoapods'
brew 'fasd'
brew 'git', args: ['without-completions']
brew 'git-flow'
brew 'mackup'
brew 'mcrypt'
brew 'mongodb'
brew 'mosquitto'
brew 'node'
brew "nvm"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew 'qt5'
brew "tmux"
brew 'trash'
brew 'wget'
brew "xcproj"
brew "xctool"
brew 'yarn'
brew 'zplug'
brew "zsh"

# Apps
cask 'aerial'
cask 'alfred'
cask 'anybar'
cask 'bartender'
cask "battle-net"
cask "calibre"
cask "caprine"
cask 'cheatsheet'
cask 'cleanmymac'
cask 'cryptomator'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'etcher'
cask 'google-chrome'
cask 'handbrake'
cask 'iterm2'
cask "keybase"
cask "kitematic"
cask "ksdiff"
cask 'lastfm'
cask 'mounty'
cask 'musixmatch'
cask 'paw'
cask 'postico'
cask 'rocket'
cask 'sequel-pro'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask "teamviewer"
cask 'transmission'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wireshark'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas "Apple Configurator 2", id: 1037126344
mas "Cardhop", id: 1290358394
mas 'DaisyDisk', id: 411643860
mas 'Deliveries', id: 924726344
mas 'Drop', id: 1173932628
mas "Finances", id: 1218241304
mas "Gemini 2", id: 1090488118
mas "IconFly", id: 556381974
mas 'iTranslate', id: 884952790
mas 'Kaleidoscope', id: 587512244
mas 'Keynote', id: 409183694
mas "Kindle", id: 405399194
mas 'Lingo', id: 624884154
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Photo Privacy', id: 428752671
mas 'Pixelmator', id: 407963104
mas 'SnippetsLab', id: 1006087419
mas 'Soulver', id: 413965349
mas "Telegram", id: 747648890
mas "Things3", id: 904280696
mas 'The Unarchiver', id: 425424353
mas "Trello", id: 1278508951
mas "WeChat", id: 836500024