tap "akeru-inc/tap"
tap "apparition47/tap"
tap "cantino/mcfly"
tap "cjbassi/ytop"
tap "clementtsang/bottom"
tap "dtan4/dtan4"
tap "filosottile/musl-cross"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mczachurski/wallpapper"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Image manipulation library
brew "jpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Collection of portable C++ source libraries
brew "boost"
# Standard SGML representation system for technical documents
brew "docbook"
# Source-code syntax highlighter
brew "source-highlight"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Archival front-end
brew "atool"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# Parser generator
brew "bison"
# Deduplicating archiver with compression and authenticated encryption
brew "borgbackup"
# Simple wrapper script for the Borg backup software
brew "borgmatic"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Tool Command Language
brew "tcl-tk"
# Vector graphics library with cross-device output support
brew "cairo"
# Easily generate Instruments traces for your rust crate
brew "cargo-instruments"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Compiler for writing C extensions for the Python language
brew "cython"
# Lightweight, framework-agnostic database migration tool
brew "dbmate"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Load/unload environment variables based on $PWD
brew "direnv"
# Minimal, fast alternative to 'du -sh'
brew "diskus"
# Tool for exploring each layer in a docker image
brew "dive"
# Command-line tool for DigitalOcean
brew "doctl"
# Command-line DNS client
brew "dog"
# More intuitive version of du in rust
brew "dust"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# Callback framework for C++
brew "libsigc++"
# C++ interface to glib
brew "glibmm"
# C++ interface to glib
brew "glibmm@2.66"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound", restart_service: true
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library for manipulating JPEG-2000 images
brew "jasper"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Command-line tool for generating regular expressions
brew "grex"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Kubernetes package manager
brew "helm"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Improved top (interactive process viewer)
brew "htop"
# Platform built on V8 to build network applications
brew "node"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Command-line benchmarking tool
brew "hyperfine"
# Database of common MIME types
brew "shared-mime-info"
# H.265/HEVC encoder
brew "x265"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# LLVM's OpenMP runtime library
brew "libomp"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Manage your Java environment
brew "jenv"
# JSON output from a shell
brew "jo"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Run local Kubernetes cluster in Docker
brew "kind"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Network authentication protocol
brew "krb5"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Linear Algebra PACKage
brew "lapack"
# Asynchronous event library
brew "libev"
# Postgres C API library
brew "libpq", link: true
# Library that provides automatic proxy configuration management
brew "libproxy"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Apache Pulsar C++ library
brew "libpulsar"
# C library implementing the SSH2 protocol
brew "libssh2"
# C websockets server library
brew "libwebsockets"
# C++ wrapper for libxml
brew "libxml++"
# GNOME XML library
brew "libxml2"
# Next-gen compiler infrastructure
brew "llvm"
# Keep your Mac's application settings in sync
brew "mackup"
# Securely transfers data between computers
brew "magic-wormhole"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Replacement for the old crypt package and crypt(1) command
brew "mcrypt"
# High performance static file server
brew "miniserve"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Remote terminal application
brew "mosh"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Optimized BLAS library
brew "openblas"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Cross-platform application and UI framework
brew "qt"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Python package management tool
brew "poetry"
# Convert bitmaps to vector graphics
brew "potrace"
# Modern replacement for ps written by Rust
brew "procs"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Version control system designed to be a better CVS
brew "subversion"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Manipulate Xcode project files
brew "xcproj"
# Fast CSV toolkit written in Rust
brew "xsv"
# JavaScript package manager
brew "yarn"
# Fast static site generator in a single binary with everything built-in
brew "zola"
# macOS app notarization helper
brew "akeru-inc/tap/xcnotary"
# McFly
brew "cantino/mcfly/mcfly"
# A TUI system monitor written in Rust
brew "cjbassi/ytop/ytop"
# A cross-platform graphical process/system monitor with a customizable interface and a multitude of features.
brew "clementtsang/bottom/bottom"
# `tail -f` experience for Kubernetes Pods
brew "dtan4/dtan4/k8stail"
# Vault
brew "hashicorp/tap/vault"
# Password manager that keeps all passwords secure behind one password
cask "1password-beta"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Apple TV Aerial screensaver
cask "aerial"
# Inspect application bundles
cask "apparency"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organizer
cask "bartender"
# E-books management software
cask "calibre"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Official CLI tool for Concourse CI
cask "fly"
cask "font-anonymice-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g-for-powerline"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-noto-emoji"
cask "font-noto-mono-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-ubuntu-mono-derivative-powerline"
# Git interface focused on visual interaction
cask "gitup"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Music services manager
cask "lastfm"
# Kubernetes IDE
cask "lens"
# Open-source Markdown editor
cask "macdown"
# File system integration
cask "macfuse"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Free and open-source RSS reader
cask "netnewswire"
# Open-source transport simulation game
cask "openttd"
# HTTP client that helps testing and describing APIs
cask "paw"
# Home media player
cask "plex"
# GUI client for PostgreSQL databases
cask "postico"
cask "quicklook-csv"
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Emoji picker optimized for blind people
cask "rocket"
# MySQL/MariaDB database management
cask "sequel-ace"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# Tool for liberating data tables trapped inside PDF files
cask "tabula"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# File transfer application
cask "transmit"
# Calling and messaging application focusing on security
cask "viber"
# VPN client for secure internet access and private browsing
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark"
# Allows access to WWDC livestreams, videos and sessions
cask "wwdc"
mas "1Password for Safari", id: 1569813296
mas "Convusic", id: 1591366129
mas "DaisyDisk", id: 411643860
mas "Data Jar", id: 1453273600
mas "Day One", id: 1055511498
mas "Developer", id: 640199958
mas "Grammarly for Safari", id: 1462114288
mas "Hush", id: 1544743900
mas "Iconic", id: 1582751983
mas "Jayson", id: 1468691718
mas "Kaleidoscope", id: 587512244
mas "Keynote", id: 409183694
mas "Keys", id: 1494642810
mas "MakePass", id: 1450989464
mas "Medis", id: 1063631769
mas "Messenger", id: 1480068668
mas "Myna for Google Translate", id: 1100290134
mas "NepTunes", id: 1006739057
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pi-hole Remote", id: 1515445551
mas "Pixelmator Pro", id: 1289583905
mas "rcmd", id: 1596283165
mas "Shazam", id: 897118787
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "Twitter", id: 1482454543
mas "Vinegar", id: 1591303229
mas "Wayback Machine", id: 1472432422
mas "Xcode", id: 497799835
