jethrokuan/z
laughedelic/brew-completions
evanlucas/fish-kubectl-completions
halostatue/fish-docker
oh-my-fish/plugin-foreign-env
oh-my-fish/plugin-bang-bang
jorgebucaran/fisher
sijad/gitignore
oh-my-fish/plugin-grc
jorgebucaran/nvm.fish
