jethrokuan/z
laughedelic/brew-completions
franciscolourenco/done
evanlucas/fish-kubectl-completions
oh-my-fish/plugin-grc
halostatue/fish-docker
oh-my-fish/plugin-foreign-env
Gazorby/fish-abbreviation-tips
oh-my-fish/plugin-gi
oh-my-fish/plugin-bang-bang
paysonwallach/fish-you-should-use
